In [1]:
import glob
import os
import pandas as pd

In [2]:
file_path  = os.getcwd()
file_list = glob.glob(file_path+'\\*.csv') #glob is used to find all the files present in a directory or a sub-directory
file_list

['/Users/parshv/files/googledrive/CodingForParshv/python-class/Introduction to pandas\\flipped_file.csv']

In [3]:
df = pd.read_csv("halfyearly_examination.csv") # this function is used to read a csv file where you need to mention the file name as a parameter

In [4]:
df.columns

Index(['subject', 'marks obtained', 'total marks'], dtype='object')

In [5]:
df['Marks in %'] = (df['marks obtained']/df['total marks'])*100

In [6]:
df

              subject  marks obtained  total marks  Marks in %
0               Maths              80           90   88.888889
1             science              60           85   70.588235
2  physical education              94          300   31.333333
3           astronomy              98          200   49.000000

In [7]:
max(df['Marks in %'])

88.88888888888889

In [8]:
df['Marks in %'].max()

88.88888888888889

In [9]:
df.head(2) # by defualt shows first 5 rows, or you can put an amount of rows wanted as a parameter

   subject  marks obtained  total marks  Marks in %
0    Maths              80           90   88.888889
1  science              60           85   70.588235

In [10]:
df.tail(2) # shows last 5 rows of the dataset, if you want to see a specific amount of rows from the bottom, then pass a number as the parameter

              subject  marks obtained  total marks  Marks in %
2  physical education              94          300   31.333333
3           astronomy              98          200   49.000000

## iloc and loc

In [11]:
df

              subject  marks obtained  total marks  Marks in %
0               Maths              80           90   88.888889
1             science              60           85   70.588235
2  physical education              94          300   31.333333
3           astronomy              98          200   49.000000

In [12]:
df.iloc[3]

subject           astronomy
marks obtained           98
total marks             200
Marks in %             49.0
Name: 3, dtype: object

#### Access columns via iloc

In [13]:
df['marks obtained']

0    80
1    60
2    94
3    98
Name: marks obtained, dtype: int64

In [14]:
df1=df.iloc[::-1,::-1]

In [20]:
df1.to_csv('flipped_file.csv')

In [23]:
reversed_ = pd.read_csv("flipped_file.csv")

In [24]:
reversed_

   ID  Marks in %  total marks  marks obtained             subject
0   3   49.000000          200              98           astronomy
1   2   31.333333          300              94  physical education
2   1   70.588235           85              60             science
3   0   88.888889           90              80               Maths